{
  "startTime": "2013-11-08 09:00",
  "sessions": [
    {
      "break": true,
      "title": "Registration",
      "duration": 40
    },
    {
      "break": true,
      "title": "Opening remarks",
      "duration": 10
    },
    {
      "background": "bridge",
      "duration": 40,

      "title": "Building with Web Components using X-Tags",
      "duration": 40,
      "description": "In this tutorial we'll take a deep dive into how Web Components (A collection of technologies that includes Shadow DOM, HTML Templates, Custom Elements, and HTML Imports) can be used as building blocks to construct a functioning web application.\n\nWe'll review how each of the technologies under the web components umbrella work, how they work together, and how x-tags makes use of them to make modular, lightweight components. Special attention will be given to building applications for mobile devices with environments such as Firefox OS, Chrome OS, and PhoneGap.",

      "speaker": {
        "name": "Angelina Fabbro",
        "photo": "angelina.jpg"
      },

      "links": [
        { "@angelinamagnum": "http://twitter.com/angelinamagnum" },
        { "github": "https://github.com/afabbro" },
        { "realityhacking.net": "http://realityhacking.net/" }
      ],

      "slides": false,
      "audio": false,
      "video": false

    },
    {
      "background": "mountains",
      "title": "Pushing the Limits of Mobile Performance",
      "description": "A focus on performance can make the difference between the success or failure of a web app. This talk will go through concrete examples of how the Mobile Gmail and Docs teams focused on performance when building their apps. Some of these techniques are well known, but others have not been shared before...",

      "speaker": {
        "name": "Andrew Grieve",
        "twitter": false,
        "photo": "agrieve.jpg"
      },

      "bio": "Andrew is a developer at Google who has worked on several mobile web projects, including Gmail and Google Docs. More recently, he's been leading a team working full-time on Cordova Android & iOS ports, both as part of the \"make the web better\" initiative, as well as a part of the Chrome Apps team",
      "links": []
    },
    {
      "break": true,
      "title": "Break (30 mins)",
      "duration": 30
    },
    {
      "background": "fence",
      "duration": 40,
      "title": "ES6 Uncensored",

      "speaker": {
        "name": "Angus Croll",
        "twitter": "angustweets",
        "photo": "angus.jpg"
      },

      "description": "The latest JavaScript standard is just around the corner and language enthusiasts are already salivating over all the new toys coming their way. But, be warned, there are best practice zealots waiting in the wings, ready to re-label the fun parts as The Bad Parts and ruin the party. This time let's get a head start on them.\n\nWith copious examples drawing on various novel, weird and wacky combinations of upcoming features, I'll show you how to go wild with ES6 and, in the process, demonstrate that play is healthy and censorship is regressive.",

      "bio": "Angus is a displaced Brit who now works for Twitter’s web platform team in San Francisco, and is one of the principal authors and maintainers of Twitter's Flight web framework. He's obsessed with JavaScript and literature in equal measure, and is a passionate advocate for the greater involvement of artists and creative thinkers in software.",

      "links": [
        { "@angustweets": "http://twitter.com/angustweets" },
        { "github": "http://github.com/angus-c" },
        { "anguscroll.com": "http://anguscroll.com" }
      ],

      "slides": false,
      "audio": false,
      "video": false

    },
    {
      "background": "shops",
      "duration": 40,
      "title": "Mobile Is Not A Thing; It Is Everything.",

      "description": "The stratospheric rise in mobile subscribers, devices, services and apps has led to an even bigger explosion in the lack of understanding of how to design, develop and most importantly, recognize new opportunities with not only these new devices, but new use cases altogether.\n\nLet's step through the processes to help identify content strategies, design workflows and forecasting methods to unlock the true potential of mobile, not only for apps, but for the web and new channels of communication altogether.",

      "speaker": {
        "name": "Joe McCann",
        "twitter": "joemccann",
        "photo": "happy-joe.jpg"
      },

      "bio": "Joe McCann is the Director of Creative Technology at Mother, an award-winning creative agency in New York City and he is also a Managing Director and Partner at The Node Firm, a global collective of Node.js experts and enthusiasts.\n\nJoe's experience in various industries is widespread: from music and live events, to fashion, to Wall Street and even real estate, the perspective he brings to the mobile, design and software engineering industries is extremely rare and unique. Joe advises a number of technology startups and has spoken at conferences all over the world including SXSW, Adobe Phonegap Day (Amsterdam), Android Only (Stockholm),  PulsoConf (Bogota, Colombia), Morningstar Financial Developers Conference (Chicago) and many, many more.",

      "links": [
        { "@joemccann": "https://twitter.com/joemccann" },
        { "github": "https://github.com/joemccann" },
        { "subprint.com": "http://subprint.com/blog" }
      ],

      "slides": false,
      "audio": false,
      "video": false
    },
    {
      "break": true,
      "duration": 90,
      "title": "Break (90 mins)"
    },
    {
      "background": "warehouse",
      "duration": 40,
      "title": "JavaScript in the Real World",
      "description": "Anything that can be written in JavaScript, will eventually be written in JavaScript. First client side web apps, then server side programs and now you can control hardware, embedded devices and even flying robots with JavaScript.\n\nWe'll look at how you can get started writing JavaScript for Ardunio and Raspberry Pi to read sensors and control servos and build your own JavaScript powered robots.",

      "speaker": {
        "name": "Andrew Nesbitt",
        "twitter": "teabass",
        "photo": "andrewnesbitt.jpg"
      },

      "bio": "Andrew is a passionate full stack developer. He spends most of his days programming in Ruby, playing with Node.js, contributing to open source projects and organising local developer user groups. He also aspires to one day take over the world with a fleet of JavaScript powered quadcopters.",

      "links": [
        { "@teabass": "http://twitter.com/teabass" },
        { "github": "http://github.com/andrew" },
        { "nesbitt.io": "http://nesbitt.io/" }
      ],

      "slides": false,
      "audio": false,
      "video": false
    },
    {
      "background": "subway",
      "duration": 40,
      "title": "Our web development workflow is completely broken",
      "description": "With the introduction of HTML5 the way we look at the browser has completely changed, but what has happen to our development workflow?\n\nIn this talk I take you through the history of web tooling and challenge the assumptions our current generation of tooling is build upon. You will realize that your web development workflow is completely broken, and that you over the years, have been making it gradually worse and more complex by adding more tools to the chain.\n\nIt's time to rethink our tooling.",
      "speaker": {
        "name": "Kenneth Auchenberg",
        "twitter": "auchenberg",
        "photo": "kenneth.jpg"
      },

      "links": [
        { "@auchenberg": "http://twitter.com/auchenberg" },
        { "kenneth.io": "http://kenneth.io/" }
      ],

      "slides": false,
      "audio": false,
      "video": false
    },
    {
      "break": true,
      "duration": 30,
      "title": "Break (30 mins)"
    },
    {
      "break": true,
      "duration": 20,
      "title": "Closing remarks"
    },
    {
      "break": true,
      "start": "19:00",
      "end": "Late",
      "duration": 90,
      "afterparty": true,
      "title": "After Party"
    },
    {
      "background": "street",
      "duration": 40,
      "title": "Stunning visuals with Maths and...no JavaScript?",
      "description": "Everybody has probably seen mathematical visualizations that were created using JavaScript. However, one thing that not everybody may know is that some of them can be perfectly replicated using nothing but HTML and CSS.\n\nThis talk is going to deconstruct some examples, explain the mathematical reasoning behind, reveal a few lesser known things about certain CSS properties and show how using a preprocessor can help with keeping these demos extremely customizable while actually writing very little code.",
      "speaker": {
        "name": "Ana Tudor",
        "twitter": "thebabydino",
        "photo": "ana.jpg"
      },
      
      "bio": "Loves maths, especially geometry. Enjoys playing with code. Passionate about experimenting & learning new things. Fascinated by astrophysics and science in general. Huge fan of technological advance & its applications in all fields. Shows an interest in motor sports, drawing, classic cartoons, rock music, cuddling toys and animals with sharp claws & big teeth. Dreams about owning a real tiger.",

      "links": [
        { "@thebabydino": "http://twitter.com/thebabydino" },
        { "about.me/thebabydino": "http://about.me/thebabydino/" }
      ],

      "slides": false,
      "audio": false,
      "video": false,

      "next": "space"
    },
    {
      "break": true,
      "background": "subway",
      "title": "More to come – submit your proposal",
      "description": "Want to speak at Full Frontal 2013? We'd love to give you the platform to speak to hundreds of developers and designers, so what are you waiting for, [get in touch](mailto:events@leftlogic.com?subject=FF2013%20Speaking%20Proposal)! Remy's interested in the idea break the browser—make of that what you will."
    }
  ]
}
