{
  "startTime": "2013-11-08 09:00",
  "sessions": [
    {
      "break": true,
      "title": "Registration",
      "duration": 40
    },
    {
      "break": true,
      "title": "Opening remarks",
      "duration": 10
    },
    {
      "break": false,
      "duration": 40,
      "title": "Flat City",

      "speaker": {
        "name": "J. Linklater-Johnson",
        "twitter": "binarytales",
        "photo": "speaker.jpg"
      },

      "description": "Software loves hierarchies: class hierarchies, object hierarchies, folder hierarchies, style hierarchies, menu hierachies. And yet, all but the most simple tree structures require levels of organizational foresight and intellectual rigour which mere humans rarely possess—and they usually end in tears.\n\nDrawing on a diverse range of web—based examples, and proposing alternatives along the way, I'll attempt to demonstrate how trees and nesting are great for birds, but mostly lousy for developers and users.",

      "details": "Session By Phil Hawksworth – Phil is a JavaScript developer who has been developing web applications since the late 90s. These days, he’s the Technical Director for The Team.",

      "slides": "http://google.com",
      "audio": "http://google.com",
      "video": "http://google.com"

    },
    {
      "break": true,
      "duration": 30,
      "title": "Break (30 mins)"
    },
    {
      "break": false,
      "duration": 40,
      "title": "Mobile Is Not A Thing; It Is Everything.",

      "speaker": {
        "name": "J. Linklater-Johnson",
        "twitter": "binarytales",
        "photo": "speaker.jpg"
      },

      "description": "The stratospheric rise in mobile subscribers, devices, services and apps has led to an even bigger explosion in the lack of understanding of how to design, develop and most importantly, recognize new opportunities with not only these new devices, but new use cases altogether.\n\nLet's step through the processes to help identify content strategies, design workflows and forecasting methods to unlock the true potential of mobile, not only for apps, but for the web and new channels of communication altogether.",

      "details": "Session By Phil Hawksworth – Phil is a JavaScript developer who has been developing web applications since the late 90s. These days, he’s the Technical Director for The Team.",

      "slides": "http://google.com",
      "audio": "http://google.com",
      "video": "http://google.com"

    }
  ]
}
