{
  "startTime": "2013-11-08 09:00",
  "sessions": [
    {
      "break": true,
      "title": "Registration",
      "duration": 40
    },
    {
      "break": true,
      "title": "Opening remarks",
      "duration": 10
    },
    {
      "background": "bridge",
      "duration": 40,
      "title": "Pushing the Limits of Mobile Performance",
      "description": "A focus on performance can make the difference between the success or failure of a web app. This talk will go through concrete examples of how the Mobile Gmail and Docs teams focused on performance when building their apps. Some of these techniques are well known, but others have not been shared before...",

      "speaker": {
        "name": "Andrew Grieve",
        "twitter": false,
        "photo": "agrieve.jpg"
      },

      "bio": "",

      "slides": false,
      "audio": false,
      "video": false

    },
    {
      "background": "mountains",
      "title": "Building with Web Components using X-Tags",
      "duration": 40,
      "description": "In this tutorial we'll take a deep dive into how Web Components (A collection of technologies that includes Shadow DOM, HTML Templates, Custom Elements, and HTML Imports) can be used as building blocks to construct a functioning web application.\n\nWe'll review how each of the technologies under the web components umbrella work, how they work together, and how x-tags makes use of them to make modular, lightweight components. Special attention will be given to building applications for mobile devices with environments such as Firefox OS, Chrome OS, and PhoneGap.",

      "speaker": {
        "name": "Angelina Fabbro",
        "twitter": "angelinamagnum",
        "photo": false
      }
    },
    {
      "break": true,
      "title": "Break (30 mins)",
      "duration": 30
    },
    {
      "background": "fence",
      "duration": 40,
      "title": "Flat City",

      "speaker": {
        "name": "Angus Croll",
        "twitter": "angustweets",
        "photo": ""
      },

      "description": "Software loves hierarchies: class hierarchies, object hierarchies, folder hierarchies, style hierarchies, menu hierachies. And yet, all but the most simple tree structures require levels of organizational foresight and intellectual rigour which mere humans rarely possess—and they usually end in tears.\n\nDrawing on a diverse range of web—based examples, and proposing alternatives along the way, I'll attempt to demonstrate how trees and nesting are great for birds, but mostly lousy for developers and users.",

      "bio": "",

      "slides": false,
      "audio": false,
      "video": false

    },
    {
      "background": "shops",
      "duration": 40,
      "title": "Mobile Is Not A Thing; It Is Everything.",

      "description": "The stratospheric rise in mobile subscribers, devices, services and apps has led to an even bigger explosion in the lack of understanding of how to design, develop and most importantly, recognize new opportunities with not only these new devices, but new use cases altogether.\n\nLet's step through the processes to help identify content strategies, design workflows and forecasting methods to unlock the true potential of mobile, not only for apps, but for the web and new channels of communication altogether.",

      "speaker": {
        "name": "Joe McCann",
        "twitter": "joemccann",
        "photo": "joe.jpg"
      },

      "bio": false,

      "slides": false,
      "audio": false,
      "video": false
    },
    {
      "break": true,
      "duration": 90,
      "title": "Break (90 mins)"
    },
    {
      "background": "warehouse",
      "duration": 40,
      "title": "JavaScript in the Real World",
      "description": "Anything that can be written in JavaScript, will eventually be written in JavaScript. First client side web apps, then server side programs and now you can control hardware, embedded devices and even flying robots with JavaScript.\n\nWe'll look at how you can get started writing JavaScript for Ardunio and Raspberry Pi to read sensors and control servos and build you own JavaScript powered robots.",

      "speaker": {
        "name": "Andrew Nesbitt",
        "twitter": "teabass",
        "photo": "andrewnesbitt.jpg"
      },

      "bio": false,

      "slides": false,
      "audio": false,
      "video": false,

      "next": "subway, space"
    },
    {
      "break": true,
      "duration": 30,
      "title": "Break (30 mins)"
    },
    {
      "break": true,
      "duration": 20,
      "title": "Closing remarks"
    },
    {
      "break": true,
      "start": "19:00",
      "end": "Late",
      "duration": 90,
      "afterparty": true,
      "title": "After Party"
    },
    {
      "break": false,
      "background": "subway",
      "title": "More to come – submit your proposal",
      "description": "Want to speak at Full Frontal 2013? We'd love to give you the platform to speak to hundreds of developers and designers, so what are you waiting for, [get in touch](mailto:events@leftlogic.com?subject=FF2013%20Speaking%20Proposal)! Remy's interested in the idea break the browser—make of that what you will."
    }

  ]
}
